# LevelType Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
LevelType Class
Members See Also
---
An object that represents a Level type.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class LevelType : LineAndTextAttrSymbol
```

Visual Basic
---
```text
Public Class LevelType _
	Inherits LineAndTextAttrSymbol
```

Visual C++
---
```text
public ref class LevelType : public LineAndTextAttrSymbol
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..ElementType Autodesk.Revit.DB..::..LineAndTextAttrSymbol Autodesk.Revit.DB..::..LevelType
# See Also
LevelType Members
Autodesk.Revit.DB Namespace